[
  {
    "complete": true,
    "chapter": "Q1 2022",
    "events": [
      {
        "complete": true,
        "title": "Build a Team",
        "description": "This is the very start of our journey. We built a team with specialized skills and discussed our vision for the future of Bad Fox MC."
      },
      {
        "complete": true,
        "title": "Start Drawing the Fox Collection",
        "description": "Fun fact: We started with the idea of creating female Boss Cats and naming them “Miss Cats”. As we started drawing them, something didn't feel right. That's when we decided to start from scratch and Bad Fox MC was born!"
      },
      {
        "complete": true,
        "title": "Plan Potential Collaborations",
        "description": "We have ambitious goals to bring our holders into the metaverse and are in talks with teams such as: OG bears, CardaStacks, ADA Realm, Boss Cat Custom Club and others. These discussions may bear fruit and add utility to our roadmap but these are still in the early stages and not guaranteed."
      }
    ]
  },
  {
    "complete": true,
    "chapter": "Q2 2022",
    "events": [
      {
        "complete": true,
        "title": "Launch Twitter & Discord",
        "description": "Our Twitter account was created at the end of March and Discord was opened to the public in early April. We are focused on purely organic growth with genuine people. Many efforts have been made to prevent bots from accessing the server or obtaining certain roles."
      },
      {
        "complete": true,
        "title": "Develop Official Website",
        "description": "Website development is initially focused on disseminating project information, BFMC artwork and exposing the team to the community. At a later stage, the website will include the minting portal, official partner listings and some cool community tools."
      },
      {
        "complete": true,
        "title": "Build Community (Events and Competitions)",
        "description": "As previously mentioned, we are focused on organic growth. We're exposing our community and project to some of the best projects on Cardano. We'll be rewarding active members with OG roles. Every OG can give 3 whitelist roles to their friends. We've received lots of positive feedback about this innovative approach. We have events announced almost every week for new OG roles. Stay tuned to our Discord!"
      },
      {
        "complete": true,
        "title": "Finalize the Fox Collection",
        "description": "At this point we should have both the female and male models ready. Now, it's time to create more traits so that the collection is as unique as possible."
      },
      {
        "complete": true,
        "title": "Start Drawing the Motorcycle Collection",
        "description": "We plan on creating our first few motorcycle prototypes before we launch our first drop. This way, our community can benefit from an early insight of what is expected after we mint the fox collection."
      },
      {
        "complete": true,
        "title": "Increase Marketing and Exposure",
        "description": "Just before the fox collection launches, we will increase marketing and exposure. We will evaluate and tailor our approach to match our growth rate."
      }
    ]
  },
  {
    "complete": false,
    "chapter": "Q3 2022",
    "events": [
      {
        "complete": true,
        "title": "Launch 1st Collection: Fox",
        "description": "There will be 6,000 foxes minted. Half female and half male. Mint prices will range from 42-62 ADA, dependent on your role (OG, WL, or Public)."
      },
      {
        "complete": false,
        "title": "ADA Payouts to Fox Holders",
        "description": "We're going to distribute 80% of our royalties to each fox holder, for every 1m in secondary volume."
      },
      {
        "complete": true,
        "title": "Announce Official Partnerships",
        "description": "By this time, we expect to have established partnerships with metaverse projects. This is when we plan on announcing these collaborations."
      },
      {
        "complete": true,
        "title": "Continued Work on the Motorcycle Collection",
        "description": "Increase rate of production and work on sneak peaks for the motorcycle collection."
      },
      {
        "complete": true,
        "title": "Start Work on the 1st Avatar Collection: 3D Fox",
        "description": "The 3D Fox avatars will serve as metaverse compatible avatars, and as soon as they'll be airdropped & sold, you can instantly use them within the OGVerse (developed by OGBears), even during the early Alpha/Beta stages."
      }
    ]
  },
  {
    "complete": false,
    "chapter": "Q4 2022",
    "events": [
      {
        "complete": false,
        "title": "Launch 2nd Collection: Motorcycle",
        "description": "There will be 3,000 motorcycles minted. Motorcycles will be minted whole, and they'll have changing traits (never done before). No individual parts. Mint price is 85 ADA per motorcycle. You can mint 1 motorycle for every 3 fox you hold."
      },
      {
        "complete": false,
        "title": "ADA Payouts to Motorcycle Holders",
        "description": "Like the Fox Collection, we're going to distribute a portion of our royalties to each motorcycle holder, for every 1m in secondary volume."
      },
      {
        "complete": false,
        "title": "Distribute $CLAY Tokens",
        "description": "Our treasury is accumulating $CLAY tokens, and by collecting certain sets of traits you will be eligible to get a few shares from the entire accumulated supply of $CLAY. The total accumulated supply is yet to be known. The amount of shares will be defined for each set of traits to be collected."
      },
      {
        "complete": false,
        "title": "Burn Event (3D Keys)",
        "description": "Holders will have the opportunity to burn 1 male fox, 1 female fox and 1 motorcycle in exchange for a 3D interactive key. The key will reward holders with metaverse related, lifetime airdrops. At a 100% burn rate there will be no more than 3,000 keys."
      },
      {
        "complete": false,
        "title": "Airdrop 1st Avatar Collection: 3D Fox",
        "description": "There will be 5,000 3D Fox avatars created. Most of the avatars will be airdropped to holders of the \"Bad Key\" (from the burn event), the remaining will be sold to holders of the OG fox & motorcycle collections, or the public. You can instantly use the avatars within the OGVerse (developed by OGBears)."
      }
    ]
  },
  {
    "complete": false,
    "chapter": "Q1 2023",
    "events": [
      {
        "complete": false,
        "title": "Develop Floor in the MetaView Tower",
        "description": "The MetaView Tower is a vertical metaverse developed by CardaStacks, as part of our partnership CardaStacks have given us an entire floor, and we will be able to start the development of our 1st motorycle club during this phase."
      },
      {
        "complete": false,
        "title": "Start Work on the 2nd Avatar Collection: Vox Fox",
        "description": "The Vox Fox avatars will serve as Boss Planet metaverse compatible avatars, they will be designed and created by our partners \"Dot Dot Labs\", they specialize in the Sandbox standard however they are capable of building for Boss Planet too."
      },
      {
        "complete": false,
        "title": "Purchase Lands in Various Metaverses",
        "description": "We will purchase lands / estates in various popular metaverses, such as Boss Planet, Cornucopias, Virtua, Pavia etc. and work towards building several motorcycle clubs for each of these metaverses."
      }
    ]
  },
  {
    "complete": false,
    "chapter": "Q2 2023",
    "events": [
      {
        "complete": false,
        "title": "Airdrop 2nd Avatar Collection: Vox Fox",
        "description": "There will be 5,000 Vox Fox avatars created. Most of the avatars will be airdropped to holders of the \"Bad Key\" (from the burn event), the remaining will be sold to holders of the OG fox & motorcycle collections, or the public. These avatars are designed to be compatible with Boss Planet (developed by Boss Cat Rocket Club)."
      },
      {
        "complete": false,
        "title": "Status Update on Land Developments",
        "description": "We will evaluate our progress on the developments of our many motorcycle clubs, and update our roadmap with an accurate estimate (if needed)."
      },
      {
        "complete": false,
        "title": "Stay Tuned..! (More Coming)",
        "description": "We plan on developing more metaverse related content, for example bringing our motorcycles to life and ride them in the metaverses we partake in. But we'll address this and more when the time is right :)"
      }
    ]
  }
]
