[
  {
    "complete": true,
    "chapter": "Q1 2022",
    "events": [
      {
        "complete": true,
        "title": "Build a Team",
        "description": "This is the very start of our journey. We built a team with specialized skills and discussed our vision for the future of Bad Fox MC."
      },
      {
        "complete": true,
        "title": "Start Drawing the Fox Collection",
        "description": "Fun fact: We started with the idea of creating female Boss Cats and naming them “Miss Cats”. As we started drawing them, something didn't feel right. That's when we decided to start from scratch and Bad Fox MC was born!"
      },
      {
        "complete": true,
        "title": "Plan Potential Collaborations",
        "description": "We have ambitious goals to bring our holders into the metaverse and are in talks with teams such as: OG bears, CardaStacks, ADA Realm, Boss Cat Custom Club and others. These discussions may bear fruit and add utility to our roadmap but these are still in the early stages and not guaranteed."
      }
    ]
  },
  {
    "complete": true,
    "chapter": "Q2 2022",
    "events": [
      {
        "complete": true,
        "title": "Launch Twitter & Discord",
        "description": "Our Twitter account was created at the end of March and Discord was opened to the public in early April. We are focused on purely organic growth with genuine people. Many efforts have been made to prevent bots from accessing the server or obtaining certain roles."
      },
      {
        "complete": true,
        "title": "Develop Official Website",
        "description": "Website development is initially focused on disseminating project information, BFMC artwork and exposing the team to the community. At a later stage, the website will include the minting portal, official partner listings and some cool community tools."
      },
      {
        "complete": true,
        "title": "Build Community (Events and Competitions)",
        "description": "As previously mentioned, we are focused on organic growth. We're exposing our community and project to some of the best projects on Cardano. We'll be rewarding active members with OG roles. Every OG can give 3 whitelist roles to their friends. We've received lots of positive feedback about this innovative approach. We have events announced almost every week for new OG roles. Stay tuned to our Discord!"
      },
      {
        "complete": true,
        "title": "Finalize the Fox Collection",
        "description": "At this point we should have both the female and male models ready. Now, it's time to create more traits so that the collection is as unique as possible."
      },
      {
        "complete": true,
        "title": "Start Drawing the Motorcycle Collection",
        "description": "We plan on creating our first few motorcycle prototypes before we launch our first drop. This way, our community can benefit from an early insight of what is expected after we mint the fox collection."
      },
      {
        "complete": true,
        "title": "Increase Marketing and Exposure",
        "description": "Just before the fox collection launches, we will increase marketing and exposure. We will evaluate and tailor our approach to match our growth rate."
      }
    ]
  },
  {
    "complete": false,
    "chapter": "Q3 2022",
    "events": [
      {
        "complete": false,
        "title": "Launch 1st Collection: Fox",
        "description": "There will be 6,000 foxes minted. Half female and half male. Mint prices will range from 42-62 ADA, dependent on your role (OG, WL, or Public)."
      },
      {
        "complete": false,
        "title": "ADA Payouts to Fox Holders",
        "description": "We're going to distribute 80% of our royalties to each fox holder, every month."
      },
      {
        "complete": true,
        "title": "Announce Official Partnerships",
        "description": "By this time, we expect to have established partnerships with metaverse projects. This is when we plan on announcing these collaborations."
      },
      {
        "complete": false,
        "title": "Continued Work on the Motorcycle Collection",
        "description": "Increase rate of production and work on sneak peaks for the motorcycle collection."
      }
    ]
  },
  {
    "complete": false,
    "chapter": "Q4 2022",
    "events": [
      {
        "complete": false,
        "title": "Launch 2nd Collection: Motorcycle",
        "description": "There will be 3000 motorcycles minted. Motorcycles will be minted whole. No individual parts. Mint prices are yet to be determined."
      },
      {
        "complete": false,
        "title": "ADA Payouts to Motorcycle Holders",
        "description": "Like the Fox Collection, we're going to distribute a portion of our royalties to each motorcycle holder, every month."
      },
      {
        "complete": false,
        "title": "Stay Tuned: Big Announcements Coming! (Burn, AirDrop Metaverse)",
        "description": "Early next year, we want to do a burn event. Holders will have the opportunity to burn 1 male fox, 1 female fox and 1 motorcycle in exchange for a 3rd generation token. The token will reward holders with metaverse related, lifetime airdrops. To achieve this ambitious plan, we have been in contact with other teams and will continue to do so going forward."
      }
    ]
  }
]
